uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
// test_stm32f4_analog - the reference bench suite for the STM32F4's
// ANALOG CONVERTERS: the ADC (RM0090 ch. 13, RM0390 ch. 13, RM0383
// ch. 11), the DAC (RM0090 ch. 14, RM0390 ch. 14) and, through them,
// util/analog.hpp and util/analog_sampler.hpp on this silicon.
//
// A test_<target>_<subject> suite is a menu of single-letter tests over
// the console, judged by brio's "ALL: N pass, M fail" grammar
// (util/testbench.hpp owns that grammar). It is a REFERENCE test: it is
// meant to keep passing through every later restructuring of the code
// under it.
//
// ONE SUITE FOR TWO CHAPTERS, and the reason is the silicon: this
// family's DAC has no internal route at all - 14.3's note connects the
// pad to the converter the moment a channel is enabled and there is no
// code that keeps it off - so the ONLY path from the DAC to the ADC is
// the BOND PAD the two share. PA4 is DAC_OUT1 and ADC12_IN4, PA5 is
// DAC_OUT2 and ADC12_IN5, on every part of the family that has both. A
// converter written and read back through one pad is this board's whole
// analog instrument, and splitting the two chapters would mean writing
// that bring-up twice.
//
// NOTHING TO WIRE. Four techniques carry it:
//   1. THE ZERO-LENGTH WIRE. The DAC drives an ADC input through one bond
//      pad and nothing else - linearity, settling, the wave generators
//      and the analog watchdog all measured against a source this program
//      sets itself.
//   2. THE FACTORY VALUES AS THE SCALE. VREFINT and its calibration at
//      0x1FFF7A2A give VDDA in millivolts with no meter; TS_CAL1 and
//      TS_CAL2 at 0x1FFF7A2C and 0x1FFF7A2E give the junction
//      temperature. All three are ADC results taken at 3.3 V, so the
//      arithmetic is a ratio and the board's own supply comes out.
//   3. THE CORE'S OWN CLOCK AS THE RULER. SysTick's VAL counts HCLK, and
//      a conversion time is measured DIFFERENTIALLY - the same loop at
//      two sampling times - so the polling overhead cancels and what is
//      left is the chapter's own cycle count.
//   4. THE EXTI's SOFTWARE TRIGGER AS A HARDWARE ONE. The last code of
//      both trigger tables is a pad's EXTI line (11 for the regular
//      group, 15 for the injected one), and EXTI_SWIER raises a line with
//      no pad involved - so the external-trigger path is exercised
//      without a timer and without a wire.
//
// THE PADS. PA4 and PA5 are the DAC's own on every part of this family,
// and what else a board hangs on them is the board's business: on the
// Nucleo-F446RE PA5 also carries LD2, which this suite USES - a LED and
// its resistor are a load, and letter d is the difference between a
// buffered output and an unbuffered one driving it. Every letter that
// claims PA5 puts it back an output driven low before it returns.
//
// A PART WITH NO PARTNER. The F401, F411 and F412 have no DAC at all and
// their device header says so, so brio's `Dac` does not exist there: nine
// letters are compiled out on such a part and each says what it needs
// when it is asked for. What stays is everything the converter can do
// against its own internal channels - the scale, the conversion times,
// the overrun modes, the errata, the sampler - and the letters that lose
// only their STIMULUS (the watchdog, the injected group) fall back to
// VREFINT, which is a fixed source this program does not choose.
//
// NOTHING FORCED. No flash is written, no option byte, no reset: every
// letter leaves the converters powered down, the internal sources off,
// the multi-ADC mode independent, both DAC pads parked, and every DMA
// stream it used stopped with its vector disabled again.
//
// What is exercised, letter by letter:
//   a  the block: the reserve's facts, the prescaler and fADC, the
//      factory values, the pads, and every refusal the config makes
//   b  the DAC as an actuator: the holding register, the output register
//      and the cycles between them, the three data formats, both triggers
//   c  the zero-length wire: the DAC's transfer curve read back through
//      ADC12_IN4, monotonic, with the buffer's own swing limits
//   d  buffered against unbuffered, on a free pad and on the LED's
//   e  the settling time, by sampling at increasing delays after a step
//   f  the conversion time in ADCCLK cycles, measured differentially per
//      resolution and per sampling time
//   g  the scale: VDDA from VREFINT, the junction temperature from both
//      formulas, VBAT/4 - and which of the two switches wins the channel
//      they share
//   h  the analog watchdog on a DAC step, single and all-channel, and its
//      thresholds proved independent of the alignment
//   i  the injected group: the tail rule, the offset and its sign,
//      auto-injection, and an injected conversion interrupting a
//      continuous regular one
//   j  dual regular simultaneous mode on ADC1 and ADC2 - two converters
//      on two DAC pads, and then both on ONE
//   k  the wave generators: the LFSR's first two words exactly, the
//      triangle's amplitude, and both seen on the pad by the ADC
//   l  overrun: raised where the chapter enables detection, absent where
//      it does not, and the recovery
//   m  the sequencer-during-conversion erratum staged, and the driver's
//      refusal that answers it
//   n  the ART prefetch against the ADC's spread (the errata's own
//      workaround, measured)
//   o  the external trigger path, through the EXTI's software trigger
//   p  AnalogSampler inside a REAL KERNEL walking three inputs
//   q  the ADC's DMA: four ranks into memory on one trigger, and the
//      same four with nobody taking them
//   r  the DAC's DMA: a table played by a hardware trigger, and the
//      underrun a spent stream leaves behind
//
// build: boards = f429zi,f446re,f411ce,f469ni
// build: monitor_speed = 115200

#include <stdint.h>

#include <variant>

#include "kernel/event_queue.hpp"
#include "kernel/fsm.hpp"
#include "kernel/tenuto.hpp"
#include "kernel/time_event.hpp"
#include "stm32f4/adc.hpp"
#include "stm32f4/clock.hpp"
#include "stm32f4/dac.hpp"
#include "stm32f4/delay.hpp"
#include "stm32f4/dma.hpp"
#include "stm32f4/exti.hpp"
#include "stm32f4/flash.hpp"
#include "stm32f4/nvic.hpp"
#include "stm32f4/pin.hpp"
#include "stm32f4/platform.hpp"
#include "stm32f4/ticker.hpp"
#include "stm32f4/usart.hpp"
#include "util/analog.hpp"
#include "util/analog_sampler.hpp"
#include "util/print.hpp"
#include "util/testbench.hpp"

#if defined(STM32F411xE)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 100'000'000, 25'000'000>;
#elif defined(STM32F429xx) || defined(STM32F469xx)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000>;
#else
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000, brio::HseMode::bypass>;
#endif
constexpr SysClock clock;

namespace {

