uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
using namespace brio;

using P = Stm32f4Platform<>;

#if defined(STM32F429xx)
using Led = Pin<'G', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
constexpr bool led_is_dac_pad = false;
#elif defined(STM32F469xx)
using Led = Pin<'G', 6>;   // LD1, lit when low
constexpr UartPins console_pins{.tx = {'B', 10, PinFunction::af7}, .rx = {'B', 11, PinFunction::af7}};
constexpr uint8_t console_instance = 3;
constexpr bool led_is_dac_pad = false;
#elif defined(STM32F411xE)
using Led = Pin<'C', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
constexpr bool led_is_dac_pad = false;
#else
using Led = Pin<'A', 5>;
constexpr UartPins console_pins{.tx = {'A', 2, PinFunction::af7}, .rx = {'A', 3, PinFunction::af7}};
constexpr uint8_t console_instance = 2;
/// The Nucleo's LD2 IS DAC_OUT2 and ADC12_IN5: this suite uses it as an
/// analog pad and as a load, and puts it back an output driven low.
constexpr bool led_is_dac_pad = true;
#endif

using Serial = Uart<console_instance, console_pins>;
constexpr Serial serial;

TestBench<Serial, 20> bench;

using Adc1 = Adc<1>;
using Pa4 = Pin<'A', 4>;
using Pa5 = Pin<'A', 5>;
using In4 = AnalogIn<Pa4>;   ///< DAC_OUT1's pad, ADC12_IN4
using In5 = AnalogIn<Pa5>;   ///< DAC_OUT2's pad, ADC12_IN5

/// The two DAC channels by index, so that no letter counts from one.
constexpr uint8_t dac_ch_pa4 = 0;
constexpr uint8_t dac_ch_pa5 = 1;

// Which of the two DAC pads is FREE and which carries a LOAD is a fact of
// the board: on the Nucleo-64 PA5 is the LED's pad (a resistor and a
// diode to ground) and PA4 is free; on the STM32F429I-DISC1 PA4 belongs
// to the display's VSYNC and something pulls it high, PA5 is the free
// one; on the 32F469IDISCOVERY NEITHER carries a load (PA4 goes to the
// Arduino header's A5 through SB12, PA5 to CN12's pin 7), so letter d has
// nothing to weigh the buffer against there and says so. The transfer
// curve wants the free pad; letter d wants both.
#if defined(STM32F429xx)
constexpr uint8_t free_ch = dac_ch_pa5;
constexpr uint8_t loaded_ch = dac_ch_pa4;
using FreeIn = In5;
using LoadedIn = In4;
constexpr const char* free_pad_name = "PA5";
constexpr const char* loaded_pad_name = "PA4 (the display's VSYNC)";
constexpr bool loaded_pad_has_load = true;
#elif defined(STM32F469xx)
constexpr uint8_t free_ch = dac_ch_pa4;
constexpr uint8_t loaded_ch = dac_ch_pa5;
using FreeIn = In4;
using LoadedIn = In5;
constexpr const char* free_pad_name = "PA4 (CN8's A5)";
constexpr const char* loaded_pad_name = "PA5 (CN12's pin 7, nothing on it)";
constexpr bool loaded_pad_has_load = false;
#else
constexpr uint8_t free_ch = dac_ch_pa4;
constexpr uint8_t loaded_ch = dac_ch_pa5;
using FreeIn = In4;
using LoadedIn = In5;
constexpr const char* free_pad_name = "PA4";
constexpr const char* loaded_pad_name = "PA5 (the LED's)";
constexpr bool loaded_pad_has_load = true;
#endif

constexpr bool have_dac = dac_present();
constexpr bool have_adc2 = adc_present(2);

/// APB2 is what the converter's prescaler divides - 90 MHz on the two
/// 180 MHz boards, 50 MHz on the black pill.
constexpr uint32_t pclk2 = SysClock::pclk2_hz;

/// Let the console's own transmitter fall silent before a timed
/// measurement: its interrupt would land in the middle of one.
void console_drain() {
    const uint32_t t0 = Ticker::ticks();
    while (!Serial::tx_idle() && Ticker::ticks() - t0 < 200u) {
    }
}

// =============================================================================
// The ruler: SysTick's VAL, accumulated across its wraps
// =============================================================================

struct Cycles {
    uint32_t last = 0;
    uint32_t total = 0;

    static uint32_t period() { return SysTick->LOAD + 1u; }
    void start() {
        total = 0;
        last = SysTick->VAL;
    }
    /// Must be called at least once per SysTick period, which every loop
    /// below does by construction (a conversion is far shorter than 1 ms).
    void mark() {
        const uint32_t now = SysTick->VAL;
        total += (last >= now) ? (last - now) : (last + period() - now);
        last = now;
    }
};

/// How many HCLK cycles one ADCCLK cycle is worth, as a Q8 fixed-point
/// ratio so that a 4:1 or 8:1 division is exact and anything else is
/// close: HCLK / fADC.
uint32_t core_cycles_per_adc_cycle_q8() {
    const uint32_t f = AdcCommon::adc_hz(pclk2);
    // 180 MHz times 256 is past what 32 bits hold, so the accumulator
    // names its width.
    return f == 0u ? 0u
                   : static_cast<uint32_t>((static_cast<uint64_t>(SysClock::hz) * 256ULL) / f);
}

// =============================================================================
// Bring-up shared by every letter
// =============================================================================

/// The converter as most letters want it: one 12-bit conversion of one
/// channel when asked, a long sampling time (the pads here are driven by
/// a DAC buffer or an internal source, and 480 cycles costs 22 us and
/// removes every source-impedance question from the numbers below).
AdcConfig base_config() {
    AdcConfig c{};
    c.resolution = AdcRes::bits12;
    c.eoc_per_conversion = true;
    return c;
}

bool adc_up(const AdcConfig& c, AdcSampleTime smp = AdcSampleTime::cycles480) {
    AdcCommon::reset();
    (void)AdcCommon::multi(AdcMulti::independent);
    if (!Adc1::init(clock, c)) {
        return false;
    }
    Adc1::sample_time_all(smp);
    Adc1::clear_flags(AdcFlag::all);
    return true;
}

// A NOTE ON THE GUARDS BELOW. Where a part has no DAC the TYPE does not
// exist (stm32f4/dac.hpp compiles its resource only under the header's
// own DAC_BASE), and a name that is not dependent is looked up even in
// the discarded branch of an `if constexpr` - so the DAC's half of this
// suite is behind the preprocessor and not behind a constant. `have_dac`
// stays for the places where only a VALUE is needed.

/// The DAC as most letters want it: the block up, one channel buffered
/// and untriggered on its own pad, its output at `code`.
#if defined(DAC_BASE)
/// One channel, with the BLOCK already up: `Dac::init()` resets every
/// register of the peripheral, so a letter that wants both channels
/// resets once and then brings each channel up with this.
bool dac_channel_up(uint8_t ch, uint16_t code, bool buffered = true) {
    if (!Dac::channel_valid(ch)) {
        return false;
    }
    if (ch == dac_ch_pa4) {
        Dac::claim_pad<Pa4>();
    } else {
        Dac::claim_pad<Pa5>();
    }
    DacChannelConfig cfg{};
    cfg.buffered = buffered;
    if (!Dac::configure(ch, cfg)) {
        return false;
    }
    (void)Dac::write(ch, code);
    (void)Dac::enable(ch, true);
    (void)delay_us(clock, 20);   // tWAKEUP, 14.3.1
    return true;
}

/// The block and one channel, for a letter that wants only one.
bool dac_up(uint8_t ch, uint16_t code, bool buffered = true) {
    Dac::init();
    return dac_channel_up(ch, code, buffered);
}
#endif

