uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
/// Every letter's exit: the converters down, the pads parked, the LED an
/// output driven low again where it is one of the pads.
void analog_down() {
    Adc1::release();
#if defined(ADC2_BASE)
    Adc<2>::release();
    Adc<3>::release();
#endif
    AdcCommon::release();
#if defined(DAC_BASE)
    Dac::release();
#endif
    Pa4::release();
    if constexpr (led_is_dac_pad) {
        Led::output(false);
    } else {
        Pa5::release();
    }
}

/// A DAC code written, given time to settle and read back on its own pad
/// by ADC1 - the zero-length wire in one call.
#if defined(DAC_BASE)
uint16_t loop_read(uint8_t ch, uint16_t code, uint8_t settle_reads = 2) {
    (void)Dac::write(ch, code);
    (void)delay_us(clock, 30);
    return Adc1::read_settled(settle_reads);
}
#endif
constexpr uint16_t max_of(uint16_t a, uint16_t b) { return a > b ? a : b; }

uint16_t abs_diff(uint16_t a, uint16_t b) { return a > b ? a - b : b - a; }

// =============================================================================
// The external trigger, with no timer and no wire
// =============================================================================

/// One SOFTWARE edge on `line`, and whether the converter answered it.
/// The pending bit is taken down FIRST: SWIER does not clear itself, and
/// a second write over a standing edge is no edge at all.
bool trigger_converts(uint8_t line, bool injected) {
    (void)Exti::clear(line);
    Adc1::clear_flags(AdcFlag::all);
    (void)Exti::trigger(line);
    for (uint32_t i = 0; i < 20000u; ++i) {
        if (injected ? Adc1::injected_ready() : Adc1::ready()) {
            return true;
        }
    }
    return false;
}

// A REAL EDGE, AND STILL NO WIRE: an output pad feeds its OWN EXTI line,
// which is the technique the EXTI chapter's own suite uses. The pads have
// to be pin 11 and pin 15 of some port, because a line's number IS its
// pin number - and which port bonds and frees those two is a BOARD fact,
// so the legs that need them run where this suite knows the answer and
// say so where it does not.
#if defined(STM32F446xx)
// PC11 and PB15, both free on the Nucleo's Morpho header. Port B has no
// pin 11 on this package at all, which is what a first attempt at PB11
// found out by getting no edge from it.
using TrigPad11 = Pin<'C', 11>;
using TrigPad15 = Pin<'B', 15>;
constexpr bool have_trigger_pads = true;

/// Point `line` at this pad, rising, with both masks as asked. STEAL and
/// not select: a letter that armed the line for the software trigger
/// first holds it, and a line already in use is what select() refuses.
template <class Pad>
void arm_pad_line(uint8_t line, bool with_event = true, bool with_interrupt = false) {
    Pad::output(false);
    (void)Exti::steal(line, Pad::port_letter);
    (void)Exti::sense(line, ExtiSense::rising);
    (void)Exti::event(line, with_event);
    // The NVIC line is never enabled in this suite, so an open IMR costs
    // a pending bit and no handler.
    (void)Exti::interrupt(line, with_interrupt);
    (void)Exti::clear(line);
}

/// One rising edge on the pad, held long enough to be seen: an edge
/// shorter than one APB2 period is not (the EXTI chapter's measurement).
template <class Pad>
void pad_edge(uint8_t line) {
    (void)Exti::clear(line);
    Pad::set();
    (void)delay_us(clock, 2);
    Pad::clear();
    (void)delay_us(clock, 2);
}

template <class Pad>
bool pad_edge_converts(uint8_t line, bool injected, bool with_event, bool with_interrupt) {
    arm_pad_line<Pad>(line, with_event, with_interrupt);
    Adc1::clear_flags(AdcFlag::all);
    Pad::set();
    (void)delay_us(clock, 2);
    bool ok = false;
    for (uint32_t i = 0; i < 20000u && !ok; ++i) {
        ok = injected ? Adc1::injected_ready() : Adc1::ready();
    }
    Pad::clear();
    (void)Exti::clear(line);
    Pad::release();
    return ok;
}
#else
constexpr bool have_trigger_pads = false;
#endif

#if !defined(DAC_BASE)
void needs_dac(const char* what) {
    print(serial, "  this part has no DAC: ", what, " needs one and claims nothing", crlf);
}
#endif

// =============================================================================
// a - the block, the clock and the facts
// =============================================================================
void ta_block() {
    print(serial, "  converters ", adc_instances(), ", common block at ", hex(adc_common_base()),
          ", one reset line for all of them", crlf);
    print(serial, "  PCLK2 ", pclk2 / 1000u, " kHz", crlf);

    bench.verdict("the reserve counts the converters the header declares",
                  adc_instances() == (have_adc2 ? 3u : 1u));
    bench.verdict("ADC1 is the master and every converter shares one vector",
                  Adc1::is_master && Adc1::irq() == ADC_IRQn);

    const bool up = adc_up(base_config());
    const AdcPrescaler p = AdcCommon::prescaler();
    const uint32_t f = AdcCommon::adc_hz(pclk2);
    print(serial, "  init: ADCPRE /", adc_prescaler_divisor(p), " -> fADC ", f / 1000u, " kHz (",
          adc_max_hz / 1000u, " kHz is the datasheets' ceiling at 3.3 V)", crlf);
    bench.verdict("the converter came up", up);
    bench.verdict("init() picked the SMALLEST division that keeps fADC legal",
                  p == adc_prescaler_for(pclk2) && f <= adc_max_hz && f >= adc_min_hz);
    bench.verdict("and half the bus was refused where half the bus is too fast",
                  (pclk2 / 2u <= adc_max_hz) == (p == AdcPrescaler::div2));
    bench.verdict("ADON is set and the converter is powered", Adc1::powered());

    // THE ACKNOWLEDGEMENT, which is what makes every sequence verb below
    // usable more than once: STRT is set by the silicon and taken down by
    // nothing but a write, so a driver that did not clear it when the
    // datum is read would answer "a conversion is in flight" for ever
    // after the first one - and refuse every selection in silence.
    AdcCommon::internal_sources(true);
    (void)Adc1::select_sync(AdcInput::vrefint);
    (void)delay_us(clock, 20);
    (void)Adc1::read();
    bench.verdict("a completed conversion is ACKNOWLEDGED by the read of its datum, so the "
                  "next selection is accepted and not refused for ever",
                  !Adc1::converting() && Adc1::select_sync(In4{}));
    AdcCommon::internal_sources(false);

    // The internal channels, as the reserve reads the manual.
    print(serial, "  internal channels: VREFINT ", adc_input_channel(AdcInput::vrefint),
          ", sensor ", adc_input_channel(AdcInput::temperature), ", VBAT ",
          adc_input_channel(AdcInput::vbat), " (/", AdcCommon::vbat_divider(), ")",
          AdcCommon::sensor_shares_vbat() ? ", sensor and battery SHARE the channel" : "", crlf);
    bench.verdict("the internal channels are the manual's numbers for this class",
                  adc_input_valid(AdcInput::vrefint) && adc_input_valid(AdcInput::temperature) &&
                      adc_input_valid(AdcInput::vbat));

    print(serial, "  factory: VREFINT_CAL ", AdcFactory::vrefint_cal(), ", TS_CAL1 ",
          AdcFactory::ts_cal1(), " (", AdcFactory::ts_cal1_celsius, " C), TS_CAL2 ",
          AdcFactory::ts_cal2(), " (", AdcFactory::ts_cal2_celsius, " C), all at ",
          AdcFactory::characterization_mv, " mV", crlf);
    bench.verdict("the three factory measurements are present and usable",
                  AdcFactory::plausible());
    bench.verdict("and they are ordered as two temperature points must be",
                  AdcFactory::ts_cal2() > AdcFactory::ts_cal1());

    // The pad map, and the refusals of the config.
    bench.verdict("the pads carry the channels every datasheet of the family gives",
                  In4::channel == 4u && In5::channel == 5u);
    AdcConfig bad = base_config();
    bad.discontinuous = true;
    bad.injected_discontinuous = true;
    bench.verdict("a config with both discontinuous modes is refused",
                  !Adc1::config_valid(bad) && !Adc1::configure(bad));
    bad = base_config();
    bad.auto_injected = true;
    bad.injected_trigger_edge = AdcEdge::rising;
    bench.verdict("an auto-injected group with an external trigger is refused",
                  !Adc1::configure(bad));
    bench.verdict("a sequence longer than sixteen is refused, and one of zero too", [] {
        static const uint8_t seq[1] = {4};
        return !Adc1::regular_sequence(seq, 17) && !Adc1::regular_sequence(seq, 0);
    }());
    bench.verdict("an injected sequence longer than four is refused", [] {
        static const uint8_t seq[1] = {4};
        return !Adc1::injected_sequence(seq, 5);
    }());
    bench.verdict("a watchdog threshold past twelve bits is refused",
                  !Adc1::watchdog_thresholds(0, 0x1000) && !Adc1::watchdog(0x1000, 0, true, false, false));
    bench.verdict("an interleave delay outside 5..20 cycles is refused",
                  !AdcCommon::interleave_delay(static_cast<uint8_t>(4)) &&
                      !AdcCommon::interleave_delay(static_cast<uint8_t>(21)));
    bench.verdict("a multi-ADC mode this part has not got the converters for is refused",
                  AdcCommon::multi(AdcMulti::triple_regular) == (adc_instances() >= 3u) &&
                      !AdcCommon::multi(static_cast<AdcMulti>(0x03)));
    (void)AdcCommon::multi(AdcMulti::independent);

