uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
#if defined(DAC_BASE)
    {
        Dac::init();
        print(serial, "  DAC: ", Dac::channels, " channel(s)",
              Dac::channels_known ? " (the manual's count)" : " (the manual was not read)",
              ", full scale ", Dac::steps, ", pads PA", dac_pad_pin(0), " and PA", dac_pad_pin(1),
              crlf);
        bench.verdict("the DAC has the two channels the manual gives this part",
                      Dac::channels == 2u && Dac::channels_known);
        DacChannelConfig w{};
        w.wave = DacWave::triangle;
        bench.verdict("a wave generator without a trigger is refused", !Dac::configure(0, w));
        DacChannelConfig d{};
        d.triggered = true;
        d.trigger = DacTrigger::software;
        d.dma = true;
        bench.verdict("a DMA request off the SOFTWARE trigger is refused (14.3.7)",
                      !Dac::configure(0, d));
        bench.verdict("a channel this part has not got is refused",
                      !Dac::write(2, 0) && !Dac::enable(2, true));
    }
#else
    needs_dac("the DAC's half of this letter");
#endif
    analog_down();
}

// =============================================================================
// b - the DAC as an actuator
// =============================================================================
void tb_dac() {
#if !defined(DAC_BASE)
    needs_dac("letter b");
#else
    {
        Dac::init();
        Dac::claim_pad<Pa4>();
        DacChannelConfig cfg{};
        bench.verdict("an untriggered buffered channel configures", Dac::configure(dac_ch_pa4, cfg));
        bench.verdict("and configuring leaves it DISABLED (14.3.6 and 14.3.9 want the enable "
                      "down while TSEL and MAMP are written)",
                      !Dac::enabled(dac_ch_pa4));
        (void)Dac::enable(dac_ch_pa4, true);
        (void)delay_us(clock, 20);

        // The holding register reaches DOR by itself, one APB1 cycle
        // later - measured in HCLK cycles, which is what this core counts.
        Cycles m{};
        (void)Dac::write(dac_ch_pa4, 0);
        (void)delay_us(clock, 5);
        m.start();
        (void)Dac::write(dac_ch_pa4, 0x0ABC);
        uint32_t polls = 0;
        while (Dac::output(dac_ch_pa4) != 0x0ABCu && polls < 1000u) {
            ++polls;
        }
        m.mark();
        print(serial, "  DHR -> DOR with no trigger: ", m.total, " HCLK cycles, ", polls,
              " read(s) of DOR (one APB1 cycle is ", SysClock::hz / SysClock::pclk1_hz,
              " of them)", crlf);
        bench.verdict("an untriggered write reaches the output register by itself",
                      Dac::output(dac_ch_pa4) == 0x0ABCu);
        bench.verdict("and it is there by the FIRST read of DOR - one APB1 cycle is shorter "
                      "than the load-and-compare that looks for it",
                      polls == 0u);

        // The three data formats all reach the same internal holding
        // register, shifted into place (14.3.3).
        (void)Dac::write8(dac_ch_pa4, 0x80);
        bench.verdict("the 8-bit format is a PLACEMENT: 0x80 lands at DHR[11:4] = 0x800",
                      Dac::code(dac_ch_pa4) == 0x800u);
        (void)Dac::write_left(dac_ch_pa4, 0xABC0);
        bench.verdict("the left-aligned format puts 0xABC0 at DHR[11:0] = 0xABC",
                      Dac::code(dac_ch_pa4) == 0xABCu);
        (void)Dac::write(dac_ch_pa4, 0x123);
        bench.verdict("and the right-aligned one is the datum itself",
                      Dac::code(dac_ch_pa4) == 0x123u);

        // With a trigger the holding register waits.
        cfg.triggered = true;
        cfg.trigger = DacTrigger::software;
        (void)Dac::enable(dac_ch_pa4, false);
        bench.verdict("a software-triggered channel configures", Dac::configure(dac_ch_pa4, cfg));
        (void)Dac::write(dac_ch_pa4, 0x555);
        (void)Dac::enable(dac_ch_pa4, true);
        (void)delay_us(clock, 20);
        const uint16_t before = Dac::output(dac_ch_pa4);
        (void)Dac::write(dac_ch_pa4, 0x777);
        (void)delay_us(clock, 5);
        const uint16_t held = Dac::output(dac_ch_pa4);
        (void)Dac::trigger(dac_ch_pa4);
        (void)delay_us(clock, 5);
        const uint16_t after = Dac::output(dac_ch_pa4);
        print(serial, "  triggered: DOR was ", before, ", stayed ", held,
              " over a write of 0x777, became ", after, " on SWTRIG", crlf);
        bench.verdict("with TEN set the holding register WAITS for the trigger",
                      held == before && after == 0x777u);
        bench.verdict("SWTRIGx clears itself once the datum has been taken (14.5.2)",
                      (Dac::regs().SWTRIGR & DAC_SWTRIGR_SWTRIG1) == 0u);

        // Both channels in one store, and both triggered at once.
        if (Dac::channels > 1u) {
            Dac::claim_pad<Pa5>();
            DacChannelConfig c2 = cfg;
            (void)Dac::enable(dac_ch_pa5, false);
            (void)Dac::configure(dac_ch_pa5, c2);
            (void)Dac::enable(dac_ch_pa5, true);
            (void)delay_us(clock, 20);
            (void)Dac::write_dual(0x111, 0x222);
            Dac::trigger_both();
            (void)delay_us(clock, 5);
            print(serial, "  dual store then one trigger: DOR1 ", Dac::output(dac_ch_pa4),
                  ", DOR2 ", Dac::output(dac_ch_pa5), crlf);
            bench.verdict("one 32-bit store carries both channels (14.4)",
                          Dac::output(dac_ch_pa4) == 0x111u && Dac::output(dac_ch_pa5) == 0x222u);
        }
        bench.verdict("no underrun happened without a DMA in sight",
                      !Dac::underrun(0) && !Dac::underrun(1));
        analog_down();
    }
#endif
}

// =============================================================================
// c - the zero-length wire: the transfer curve
// =============================================================================
void tc_transfer() {
#if !defined(DAC_BASE)
    needs_dac("letter c");
#else
    {
        if (!adc_up(base_config()) || !dac_up(free_ch, 0)) {
            bench.verdict("the converters came up", false);
            return;
        }
        Adc1::select(FreeIn{});

        uint16_t last = 0;
        bool monotonic = true;
        uint16_t worst = 0;
        uint16_t worst_code = 0;
        const uint16_t at_zero = loop_read(free_ch, 0, 4);
        for (uint16_t code = 0; code <= 4095u; code = static_cast<uint16_t>(code + 128u)) {
            const uint16_t got = loop_read(free_ch, code);
            if (code != 0u && got + 8u < last) {
                monotonic = false;
            }
            last = got;
            // The middle of the range is where a buffered output is
            // linear; the ends are its own swing limit and are judged
            // separately.
            if (code >= 256u && code <= 3840u) {
                const uint16_t err = abs_diff(got, code);
                if (err > worst) {
                    worst = err;
                    worst_code = code;
                }
            }
            if ((code & 0x1FFu) == 0u) {
                print(serial, "    code ", code, " -> ", got, crlf);
            }
        }
        const uint16_t at_full = loop_read(free_ch, 4095, 4);
        print(serial, "  buffered swing: code 0 reads ", at_zero, ", code 4095 reads ", at_full,
              "; worst error over codes 256..3840 is ", worst, " LSB at code ", worst_code, crlf);

