uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
        bench.verdict("the curve is MONOTONIC over the whole range", monotonic);
        // The bound is 1.5 % of full scale and the number printed above is
        // the measurement: what it contains is the DAC's own error, the
        // ADC's, and the two converters' shared reference - a round trip
        // through both, and neither of them alone.
        bench.verdict("and the round trip through both converters stays within 1.5 % of full "
                      "scale away from the rails", worst < 62u);
        bench.verdict("the BUFFER cannot reach either rail - the ends of the curve are its own "
                      "output swing and not the converter's",
                      at_zero > 20u && at_full < 4075u);
        analog_down();
    }
#endif
}

// =============================================================================
// d - buffered against unbuffered, free pad and loaded pad
// =============================================================================
void td_buffer() {
#if !defined(DAC_BASE)
    needs_dac("letter d");
#else
    {
        if (!adc_up(base_config())) {
            bench.verdict("the converter came up", false);
            return;
        }
        static const uint16_t codes[3] = {0, 2048, 4095};
        uint16_t free_buf[3] = {0, 0, 0};
        uint16_t free_raw[3] = {0, 0, 0};
        uint16_t load_buf[3] = {0, 0, 0};
        uint16_t load_raw[3] = {0, 0, 0};

        for (uint8_t pass = 0; pass < 2u; ++pass) {
            const bool buffered = pass == 0u;
            (void)dac_up(free_ch, 0, buffered);
            Adc1::select(FreeIn{});
            for (uint8_t i = 0; i < 3u; ++i) {
                const uint16_t v = loop_read(free_ch, codes[i], 4);
                if (buffered) {
                    free_buf[i] = v;
                } else {
                    free_raw[i] = v;
                }
            }
            if (Dac::channels > 1u) {
                (void)dac_up(loaded_ch, 0, buffered);
                Adc1::select(LoadedIn{});
                for (uint8_t i = 0; i < 3u; ++i) {
                    const uint16_t v = loop_read(loaded_ch, codes[i], 4);
                    if (buffered) {
                        load_buf[i] = v;
                    } else {
                        load_raw[i] = v;
                    }
                }
            }
            Dac::release();
        }

        print(serial, "  free pad ", free_pad_name, ": buffered ", free_buf[0], "/", free_buf[1], "/",
              free_buf[2], ", unbuffered ", free_raw[0], "/", free_raw[1], "/", free_raw[2],
              " (codes 0/2048/4095)", crlf);
        print(serial, "  loaded pad ", loaded_pad_name, ": buffered ", load_buf[0], "/", load_buf[1], "/",
              load_buf[2], ", unbuffered ", load_raw[0], "/", load_raw[1], "/", load_raw[2], crlf);

        bench.verdict("UNBUFFERED REACHES THE RAILS and buffered does not: on a pad with "
                      "nothing on it the unbuffered output is nearer both ends",
                      free_raw[0] < free_buf[0] && free_raw[2] > free_buf[2]);
        bench.verdict("and it is still linear in the middle of the range with only the ADC's "
                      "own sampling network on it",
                      abs_diff(free_raw[1], 2048u) < 60u);
        if (Dac::channels > 1u) {
            // The load's direction is the board's (the LED sinks at full
            // scale, a pull-up lifts at zero), so the judgement is by how
            // much farther the UNBUFFERED output strays from the free pad's
            // than the buffered one does, at whichever rail the load fights.
            uint16_t raw_stray = 0, buf_stray = 0;
            for (uint8_t r = 0; r < 3u; r += 2u) {
                raw_stray = max_of(raw_stray, abs_diff(load_raw[r], free_raw[r]));
                buf_stray = max_of(buf_stray, abs_diff(load_buf[r], free_buf[r]));
            }
            print(serial, "  the load moves the unbuffered output ", raw_stray,
                  " LSB from the free pad's at the rail it fights, the buffered one ", buf_stray, crlf);
            if constexpr (loaded_pad_has_load) {
                bench.verdict("A LOAD IS WHAT THE BUFFER IS FOR: the load pulls the UNBUFFERED "
                              "output far from the code it was given at one rail, while the "
                              "buffered one holds",
                              raw_stray > buf_stray + 200u);
            } else {
                print(serial, "  no load on either DAC pad of this board: the buffer's job is "
                              "not measurable here (declined by name)", crlf);
            }
        }
        analog_down();
    }
#endif
}

// =============================================================================
// e - the settling time after a step
// =============================================================================
void te_settling() {
#if !defined(DAC_BASE)
    needs_dac("letter e");
#else
    {
        AdcConfig c = base_config();
        // A SHORT sampling time is what makes this a probe rather than an
        // average: 15 ADCCLK cycles is 0.67 us at 22.5 MHz, and the DAC's
        // buffer is low enough an impedance for it.
        if (!adc_up(c, AdcSampleTime::cycles15) || !dac_up(dac_ch_pa4, 0)) {
            bench.verdict("the converters came up", false);
            return;
        }
        Adc1::select(In4{});
        static const uint16_t delays_us[6] = {0, 1, 2, 5, 10, 20};
        uint16_t got[6] = {0, 0, 0, 0, 0, 0};
        for (uint8_t i = 0; i < 6u; ++i) {
            (void)Dac::write(dac_ch_pa4, 0);
            (void)delay_us(clock, 200);
            (void)Adc1::read();
            Adc1::clear_flags(AdcFlag::all);
            (void)Dac::write(dac_ch_pa4, 4000);
            if (delays_us[i] != 0u) {
                (void)delay_us(clock, delays_us[i]);
            }
            got[i] = Adc1::read();
        }
        const uint16_t settled = loop_read(dac_ch_pa4, 4000, 4);
        print(serial, "  after a 0 -> 4000 step, one 15-cycle conversion started at");
        for (uint8_t i = 0; i < 6u; ++i) {
            print(serial, " +", delays_us[i], "us:", got[i]);
        }
        print(serial, "; settled ", settled, crlf);

        uint16_t first_within = 0xFFFFu;
        for (uint8_t i = 0; i < 6u; ++i) {
            if (abs_diff(got[i], settled) <= 40u) {
                first_within = delays_us[i];
                break;
            }
        }
        print(serial, "  within 1 % of the settled value from +", first_within, " us", crlf);
        bench.verdict("the step is NOT there at once - the reading taken with no delay is "
                      "below the settled one", got[0] + 40u < settled);
        bench.verdict("and it is within 1 % well inside the 20 us this letter waits",
                      first_within <= 20u);
        analog_down();
    }
#endif
}

