uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
// =============================================================================
// f - the conversion time in ADCCLK cycles, measured differentially
// =============================================================================
void tf_timing() {
    if (!adc_up(base_config())) {
        bench.verdict("the converter came up", false);
        return;
    }
    AdcCommon::internal_sources(true);
    Adc1::select(AdcInput::vrefint);
    (void)delay_us(clock, 20);
    console_drain();

    const uint32_t q8 = core_cycles_per_adc_cycle_q8();
    print(serial, "  fADC ", AdcCommon::adc_hz(pclk2) / 1000u, " kHz, HCLK ", SysClock::hz / 1000u,
          " kHz: one ADCCLK cycle is ", q8 / 256u, " and ", (q8 % 256u) * 100u / 256u,
          "/100 HCLK cycles", crlf);

    static const AdcRes res[4] = {AdcRes::bits12, AdcRes::bits10, AdcRes::bits8, AdcRes::bits6};
    static const char* res_name[4] = {"12", "10", " 8", " 6"};
    static const AdcSampleTime smp[3] = {AdcSampleTime::cycles3, AdcSampleTime::cycles84,
                                         AdcSampleTime::cycles480};
    const uint16_t rounds = 128;
    bool all_close = true;
    uint32_t overhead_cycles = 0;

    for (uint8_t r = 0; r < 4u; ++r) {
        AdcConfig c = base_config();
        c.resolution = res[r];
        (void)Adc1::configure(c);
        uint32_t per[3] = {0, 0, 0};
        for (uint8_t s = 0; s < 3u; ++s) {
            Adc1::sample_time_all(smp[s]);
            (void)Adc1::read();   // one throwaway: the first after a change
            Cycles m{};
            m.start();
            for (uint16_t k = 0; k < rounds; ++k) {
                (void)Adc1::read();
                m.mark();
            }
            per[s] = m.total / rounds;
        }
        // THE DIFFERENCE is the measurement: the same loop at two
        // sampling times differs by exactly the sampling times' own
        // difference, and every cycle of polling overhead cancels.
        const uint32_t measured = per[2] - per[0];
        const uint32_t predicted =
            ((adc_sample_cycles(smp[2]) - adc_sample_cycles(smp[0])) * q8) / 256u;
        const uint32_t err = measured > predicted ? measured - predicted : predicted - measured;
        print(serial, "    ", res_name[r], " bits: ", per[0], " / ", per[1], " / ", per[2],
              " HCLK per conversion at 3 / 84 / 480 cycles; 477 ADCCLK cycles measured ",
              measured, " HCLK, predicted ", predicted, crlf);
        if (err * 100u > predicted) {
            all_close = false;
        }
        if (r == 0u) {
            // What is left when the chapter's own cycles are taken out of
            // the shortest conversion is the polling loop.
            const uint32_t conv =
                (adc_conversion_cycles(res[0], smp[0]) * q8) / 256u;
            overhead_cycles = per[0] > conv ? per[0] - conv : 0u;
        }
    }
    print(serial, "  the polling loop around one conversion costs ", overhead_cycles,
          " HCLK cycles", crlf);
    bench.verdict("the sampling time's contribution is the chapter's own, to under 1 %, at "
                  "every resolution", all_close);

    // And the SAR's own contribution, the other axis of the same table.
    Adc1::sample_time_all(AdcSampleTime::cycles3);
    uint32_t at12 = 0, at6 = 0;
    for (uint8_t pass = 0; pass < 2u; ++pass) {
        AdcConfig c = base_config();
        c.resolution = pass == 0u ? AdcRes::bits12 : AdcRes::bits6;
        (void)Adc1::configure(c);
        Adc1::sample_time_all(AdcSampleTime::cycles3);
        (void)Adc1::read();
        Cycles m{};
        m.start();
        for (uint16_t k = 0; k < rounds; ++k) {
            (void)Adc1::read();
            m.mark();
        }
        (pass == 0u ? at12 : at6) = m.total / rounds;
    }
    const uint32_t sar_measured = at12 - at6;
    const uint32_t sar_predicted =
        ((adc_sar_cycles(AdcRes::bits12) - adc_sar_cycles(AdcRes::bits6)) * q8) / 256u;
    print(serial, "  12 bits costs ", sar_measured, " HCLK more than 6 at the same sampling "
          "time; six SAR cycles predict ", sar_predicted, crlf);
    // The tolerance is 15 % plus ONE ADCCLK cycle: the polling loop's own
    // granularity is a few HCLK, which is a whole ADCCLK cycle where the
    // prescaler is four.
    bench.verdict("and the RESOLUTION's contribution is one ADCCLK cycle per bit (13.7)",
                  abs_diff(static_cast<uint16_t>(sar_measured),
                           static_cast<uint16_t>(sar_predicted)) * 100u <=
                      sar_predicted * 15u + (q8 * 100u) / 256u);
    AdcCommon::internal_sources(false);
    analog_down();
}

// =============================================================================
// g - the scale: VDDA, the junction temperature, the battery
// =============================================================================
void tg_scale() {
    if (!adc_up(base_config())) {
        bench.verdict("the converter came up", false);
        return;
    }
    AdcCommon::internal_sources(true);
    (void)delay_us(clock, 20);   // tSTART, the sensor's and the reference's

    Adc1::select(AdcInput::vrefint);
    const uint16_t vrefint = Adc1::read_settled(4);
    const uint16_t vdda = Adc1::vdda_mv(vrefint);
    print(serial, "  VREFINT reads ", vrefint, " against a calibration of ",
          AdcFactory::vrefint_cal(), " -> VDDA ", vdda, " mV", crlf);
    bench.verdict("VREFINT measures the supply, and it is a 3 V-class board (2.7..3.6 V)",
                  vdda >= 2700u && vdda <= 3600u);
    bench.verdict("the raw count is near the calibration's own, as it must be on a board "
                  "whose rail is near the 3.3 V ST used",
                  abs_diff(vrefint, AdcFactory::vrefint_cal()) < 200u);

    Adc1::select(AdcInput::temperature);
    const uint16_t ts = Adc1::read_settled(4);
    const int32_t tc = Adc1::temperature_centi_c(ts, vdda);
    const uint16_t ts_mv = adc_mv(ts, Adc1::result_steps(), vdda);
    const int32_t tc_typ = Adc1::temperature_centi_c_typical(ts_mv);
    print(serial, "  sensor reads ", ts, " (", ts_mv, " mV): ", tc / 100, ".",
          (tc % 100) / 10, " C from the two calibration points, ", tc_typ / 100, ".",
          (tc_typ % 100) / 10, " C from the datasheet's typical slope", crlf);
    bench.verdict("the junction temperature is a room-temperature one", tc > 0 && tc < 6000);
    bench.verdict("and the two formulas disagree by less than the sensor's own part-to-part "
                  "offset, which the manual puts at up to 45 C",
                  (tc > tc_typ ? tc - tc_typ : tc_typ - tc) < 4500);

    // The battery, and the switch that wins the channel they share.
    AdcCommon::vbat(true);
    Adc1::select(AdcInput::vbat);
    const uint16_t vbat_raw = Adc1::read_settled(4);
    const uint16_t vbat_mv = static_cast<uint16_t>(
        adc_mv(vbat_raw, Adc1::result_steps(), vdda) * AdcCommon::vbat_divider());
    print(serial, "  VBAT/", AdcCommon::vbat_divider(), " reads ", vbat_raw, " -> VBAT ",
          vbat_mv, " mV", crlf);
    bench.verdict("the battery pin measures the supply it is tied to on this board, through "
                  "the bridge the chapter names",
                  abs_diff(vbat_mv, vdda) < 200u);

    if (AdcCommon::sensor_shares_vbat()) {
        // BOTH switches on: 13.11 says the battery wins, and the reading
        // is what says so - the sensor's count and the battery's are far
        // apart.
        const uint16_t both = Adc1::read_settled(4);
        AdcCommon::vbat(false);
        Adc1::select(AdcInput::temperature);
        const uint16_t sensor_only = Adc1::read_settled(4);
        print(serial, "  with TSVREFE and VBATE both set the shared channel reads ", both,
              " (battery ", vbat_raw, ", sensor ", sensor_only, " - only ",
              abs_diff(vbat_raw, sensor_only), " LSB apart on a 3.3 V board, which is what "
              "makes this a close-run reading and not an obvious one)", crlf);
        // What the shared channel reads with both switches set is a fact of
        // the part: the battery alone on one, neither source alone on
        // another (measured) - reported, and judged only in that the reading
        // is not the sensor's alone.
        print(serial, "  13.11's precedence: the reading is ",
              abs_diff(both, vbat_raw) <= 20u ? "the BATTERY's"
              : abs_diff(both, sensor_only) <= 20u ? "the SENSOR's" : "NEITHER source alone", crlf);
        bench.verdict("with both switches set the shared channel is not the sensor alone",
                      abs_diff(both, sensor_only) > 15u || abs_diff(both, vbat_raw) <= 20u);
    }
    AdcCommon::vbat(false);
    AdcCommon::internal_sources(false);
    analog_down();
}

