uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
// =============================================================================
// h - the analog watchdog
// =============================================================================
void th_watchdog() {
    if (!adc_up(base_config())) {
        bench.verdict("the converter came up", false);
        return;
    }
    // The stimulus is the DAC where there is one and VREFINT where there
    // is not: a fixed source still proves the window, only not the
    // crossing.
    uint8_t channel = adc_input_channel(AdcInput::vrefint);
#if defined(DAC_BASE)
    if (dac_up(dac_ch_pa4, 2048)) {
        channel = In4::channel;
    }
#else
    AdcCommon::internal_sources(true);
    (void)delay_us(clock, 20);
#endif
    (void)Adc1::select_channel(channel);
    const uint16_t middle = Adc1::read_settled(4);
    print(serial, "  guarding channel ", channel, ", which reads ", middle, crlf);

    const uint16_t low = static_cast<uint16_t>(middle > 600u ? middle - 600u : 0u);
    const uint16_t high = static_cast<uint16_t>(middle + 600u > 4095u ? 4095u : middle + 600u);
    bench.verdict("a single-channel window arms", Adc1::watchdog(low, high, true, false, true, channel));
    bench.verdict("and the register holds what it was given",
                  Adc1::watchdog_low() == low && Adc1::watchdog_high() == high &&
                      Adc1::watchdog_channel() == channel);
    Adc1::clear_flags(AdcFlag::all);
    (void)Adc1::read();
    const bool inside_quiet = !Adc1::flag(AdcFlag::watchdog);
    bench.verdict("a conversion INSIDE the window raises nothing", inside_quiet);

#if defined(DAC_BASE)
    {
        (void)loop_read(dac_ch_pa4, 200);
        Adc1::clear_flags(AdcFlag::all);
        (void)Adc1::read();
        const bool below = Adc1::flag(AdcFlag::watchdog);
        (void)loop_read(dac_ch_pa4, 3900);
        Adc1::clear_flags(AdcFlag::all);
        (void)Adc1::read();
        const bool above = Adc1::flag(AdcFlag::watchdog);
        print(serial, "  window [", low, ", ", high, "]: below it AWD ", below ? "up" : "down",
              ", above it AWD ", above ? "up" : "down", crlf);
        bench.verdict("a DAC step out of the window raises AWD on both sides", below && above);

        // 13.3.8: the comparison happens BEFORE alignment, so the same
        // window holds with ALIGN set - which is exactly the trap a
        // caller who reads only the data register would fall into.
        AdcConfig c = base_config();
        c.left_aligned = true;
        (void)Adc1::configure(c);
        (void)loop_read(dac_ch_pa4, 2048);
        Adc1::clear_flags(AdcFlag::all);
        const uint16_t left = Adc1::read();
        const bool quiet_left = !Adc1::flag(AdcFlag::watchdog);
        (void)loop_read(dac_ch_pa4, 200);
        Adc1::clear_flags(AdcFlag::all);
        (void)Adc1::read();
        const bool fired_left = Adc1::flag(AdcFlag::watchdog);
        print(serial, "  left-aligned, the same window: 2048 reads ", left, " and is quiet, 200 ",
              fired_left ? "fires" : "does not fire", crlf);
        bench.verdict("13.3.8 MEASURED: the thresholds are compared before the alignment, so "
                      "a left-aligned result four bits up still lands in the same window",
                      quiet_left && fired_left && left > 2048u);
        (void)Adc1::configure(base_config());

        // All channels, the other row of table 85.
        bench.verdict("an all-channel window arms", Adc1::watchdog(low, high, true, false, false));
        (void)loop_read(dac_ch_pa4, 2048);
        Adc1::clear_flags(AdcFlag::all);
        (void)Adc1::read();
        bench.verdict("and the guarded value is still inside it", !Adc1::flag(AdcFlag::watchdog));
    }
#else
    print(serial, "  no DAC: the crossing cannot be staged from here", crlf);
#endif
    Adc1::watchdog_off();
    bench.verdict("the watchdog disarms and the flag stays down through a conversion", [] {
        Adc1::clear_flags(AdcFlag::all);
        (void)Adc1::watchdog_thresholds(0, 0);
        (void)Adc1::read();
        return !Adc1::flag(AdcFlag::watchdog);
    }());
    AdcCommon::internal_sources(false);
    analog_down();
}

// =============================================================================
// i - the injected group
// =============================================================================
void ti_injected() {
    if (!adc_up(base_config())) {
        bench.verdict("the converter came up", false);
        return;
    }
    uint8_t regular_ch = adc_input_channel(AdcInput::vrefint);
    uint8_t injected_ch = adc_input_channel(AdcInput::vrefint);
#if defined(DAC_BASE)
    Dac::init();
    (void)dac_channel_up(dac_ch_pa4, 1000);
    (void)dac_channel_up(dac_ch_pa5, 3000);
    regular_ch = In4::channel;
    injected_ch = In5::channel;
#else
    (void)regular_ch;
    AdcCommon::internal_sources(true);
    (void)delay_us(clock, 20);
#endif

    // THE TAIL RULE. One channel means JSQ4 and nothing else (13.13.12).
    static uint8_t one[1] = {0};
    one[0] = injected_ch;
    bench.verdict("a one-channel injected sequence writes", Adc1::injected_sequence(one, 1));
    print(serial, "  JSQR slots 1..4 hold ", Adc1::injected_slot_channel(1), " ",
          Adc1::injected_slot_channel(2), " ", Adc1::injected_slot_channel(3), " ",
          Adc1::injected_slot_channel(4), " for a list of one channel ", injected_ch, crlf);
    bench.verdict("13.13.12's TAIL RULE is hidden by the verb: a list of one lands in JSQ4, "
                  "which is the slot a JL of 0 converts",
                  Adc1::injected_slot_channel(4) == injected_ch && Adc1::injected_length() == 1u);

    int16_t inj = 0;
    bench.verdict("an injected conversion completes", Adc1::read_injected(inj));
    print(serial, "  JDR1 reads ", inj, crlf);

    // The offset, and the sign it can produce.
    (void)Adc1::injected_offset(1, 500);
    int16_t with_offset = 0;
    (void)Adc1::read_injected(with_offset);
    print(serial, "  with JOFR1 = 500 the same conversion reads ", with_offset, crlf);
    bench.verdict("the injected offset is SUBTRACTED from the raw result",
                  abs_diff(static_cast<uint16_t>(inj - with_offset), 500u) < 40u);
    (void)Adc1::injected_offset(1, 4000);
    int16_t negative = 0;
    (void)Adc1::read_injected(negative);
    print(serial, "  with JOFR1 = 4000 it reads ", negative,
          " - the only signed datapath this converter has", crlf);
    bench.verdict("and it can push the result below zero, sign-extended", negative < 0);
    (void)Adc1::injected_offset(1, 0);

