uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
#if defined(DAC_BASE)
    {
        // THE PREEMPTION. A continuous regular run on one pad, an
        // injected conversion on the other: the injected result is the
        // OTHER pad's, and the regular run carries on.
        // EOCS = 0, ON PURPOSE: with EOC at the end of the sequence and
        // no DMA there is no overrun detection at all (13.8.3), so a
        // continuous run nobody reads keeps running instead of stopping
        // at the first unread result - which is what lets this letter
        // leave it alone while the injected group takes the converter.
        // Letter l is where the other choice is measured.
        AdcConfig c = base_config();
        c.continuous = true;
        c.eoc_per_conversion = false;
        (void)Adc1::configure(c);
        (void)Adc1::select_channel(regular_ch);
        Adc1::clear_flags(AdcFlag::all);
        Adc1::start();
        (void)delay_us(clock, 200);
        const uint16_t regular_before = Adc1::result();
        int16_t injected = 0;
        const bool got = Adc1::read_injected(injected);
        (void)delay_us(clock, 200);
        const bool still_running = Adc1::ready();
        const uint16_t regular_after = Adc1::result();
        Adc1::stop();
        print(serial, "  continuous regular on channel ", regular_ch, " reads ", regular_before,
              "; an injected conversion of channel ", injected_ch, " reads ", injected,
              "; the regular run then reads ", regular_after, crlf);
        bench.verdict("an injected trigger INTERRUPTS the regular run and converts its own "
                      "channel - two pads, two values, one converter",
                      got && abs_diff(static_cast<uint16_t>(injected), regular_before) > 800u);
        bench.verdict("and the regular sequence RESUMES afterwards, still on its own channel",
                      still_running && abs_diff(regular_after, regular_before) < 200u);

        // AUTO-INJECTION: no trigger at all, the injected group follows
        // the regular one by itself.
        c = base_config();
        c.auto_injected = true;
        bench.verdict("an auto-injected config takes", Adc1::configure(c));
        (void)Adc1::select_channel(regular_ch);
        Adc1::clear_flags(AdcFlag::all);
        (void)Adc1::read();
        uint32_t spins = 0;
        while (!Adc1::injected_ready() && spins < 100000u) {
            ++spins;
        }
        const int16_t auto_value = Adc1::injected_result(1);
        print(serial, "  JAUTO: one regular conversion, and JEOC arrived after ", spins,
              " polls with JDR1 = ", auto_value, crlf);
        bench.verdict("with JAUTO the injected group runs after the regular one with NO "
                      "trigger of its own (13.3.10)",
                      Adc1::injected_ready() &&
                          abs_diff(static_cast<uint16_t>(auto_value), regular_before) > 800u);
        (void)Adc1::configure(base_config());
    }
#endif
    AdcCommon::internal_sources(false);
    analog_down();
}

// =============================================================================
// j - dual regular simultaneous mode
// =============================================================================
void tj_dual() {
#if !defined(ADC2_BASE)
    print(serial, "  this part has ADC1 alone: the multi-ADC modes need two converters and "
                  "this letter claims nothing", crlf);
#else
#if !defined(DAC_BASE)
    needs_dac("letter j's stimulus");
#else
    {
        using Adc2 = Adc<2>;
        if (!adc_up(base_config())) {
            bench.verdict("the converters came up", false);
            return;
        }
        Adc2::bus_clock(true);
        if (!Adc2::configure(base_config()) || !Adc2::power_on(clock)) {
            bench.verdict("ADC2 came up", false);
            return;
        }
        Adc2::sample_time_all(AdcSampleTime::cycles480);
        Dac::init();
        (void)dac_channel_up(dac_ch_pa4, 1200);
        (void)dac_channel_up(dac_ch_pa5, 3000);

        // First the single-converter answers, as the reference.
        Adc1::select(In4{});
        const uint16_t single4 = Adc1::read_settled(4);
        Adc1::select(In5{});
        const uint16_t single5 = Adc1::read_settled(4);

        // TWO PADS, TWO CONVERTERS, ONE TRIGGER - the arrangement 13.9.2
        // is written for.
        Adc1::select(In4{});
        (void)Adc2::select_channel(In5::channel);
        bench.verdict("regular simultaneous mode selects", AdcCommon::multi(AdcMulti::dual_regular));
        Adc1::clear_flags(AdcFlag::all);
        Adc2::clear_flags(AdcFlag::all);
        Adc1::start();
        uint32_t spins = 0;
        while (!Adc1::ready() && spins < 100000u) {
            ++spins;
        }
        const uint32_t pair = AdcCommon::data();
        const uint32_t csr = AdcCommon::status();
        const uint16_t master = Adc1::result();
        const uint16_t slave = Adc2::result();
        print(serial, "  two pads, one trigger: ADC1 ", master, " (single ", single4,
              "), ADC2 ", slave, " (single ", single5, ") after ", spins, " polls; CSR ",
              hex(csr), ", CDR ", hex(pair), crlf);
        bench.verdict("ONE trigger on the MASTER converts BOTH: neither converter was started "
                      "by itself and both have a result",
                      abs_diff(master, single4) < 60u && abs_diff(slave, single5) < 60u);
        bench.verdict("and the common status register shows both ends of the pair, which is "
                      "the only place a reader of one converter can see the other",
                      (csr & AdcFlag::converted) != 0u &&
                          ((csr >> 8) & AdcFlag::converted) != 0u);
        // AND THE COMMON DATA REGISTER IS NOT LOADED YET. 13.13.17 says
        // ADC_CDR holds the pair in dual mode and does not say what turns
        // it on; measured, with DMA[1:0] at 00 it stays at zero however
        // many pairs have converted, and selecting a multi-ADC DMA mode -
        // with no stream armed and nothing to serve the requests - is
        // what starts filling it.
        AdcCommon::multi_dma(AdcMultiDma::mode2, false);
        Adc1::clear_flags(AdcFlag::all);
        Adc2::clear_flags(AdcFlag::all);
        Adc1::start();
        spins = 0;
        while (!Adc1::ready() && spins < 100000u) {
            ++spins;
        }
        const uint32_t with_dma = AdcCommon::data();
        const uint32_t slave_sr = Adc2::flags();
        AdcCommon::multi_dma(AdcMultiDma::off, false);
        print(serial, "  with DMA[1:0] = 10 selected and no stream armed, CDR ", hex(with_dma),
              " -> ADC1 ", static_cast<uint16_t>(with_dma & 0xFFFFu), ", ADC2 ",
              static_cast<uint16_t>(with_dma >> 16), "; the slave's own SR reads ",
              hex(slave_sr), crlf);
        bench.verdict("and the SLAVE's own EOC does NOT stand after such a round - the pair "
                      "went to the common register and the datum the slave's DR holds is not "
                      "flagged, which is why a reconfiguration has to clear its STRT by hand",
                      (slave_sr & AdcFlag::started) != 0u &&
                          (slave_sr & AdcFlag::converted) == 0u);
        bench.verdict("THE COMMON DATA REGISTER IS THE DMA's: at DMA[1:0] = 00 it stays zero "
                      "however many pairs convert, and a multi-ADC DMA mode fills it with the "
                      "pair - the master in the low half - with no stream in sight",
                      pair == 0u && abs_diff(static_cast<uint16_t>(with_dma & 0xFFFFu), master) < 60u &&
                          abs_diff(static_cast<uint16_t>(with_dma >> 16), slave) < 60u);

