uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
        // ONE PAD, TWO CONVERTERS - which 13.9.2's own note tells an
        // application not to do ("no overlapping sampling times for the
        // two ADCs when converting the same channel"). What it costs is
        // the point of measuring it.
        (void)AdcCommon::multi(AdcMulti::independent);
        Adc1::clear_flags(AdcFlag::all);
        Adc2::clear_flags(AdcFlag::all);
        const bool moved = Adc2::select_channel(In4::channel);
        print(serial, "  ADC2 moved to channel ", Adc2::sequence_channel(1), " (the write was ",
              moved ? "taken" : "REFUSED", ")", crlf);
        (void)AdcCommon::multi(AdcMulti::dual_regular);
        Adc1::clear_flags(AdcFlag::all);
        Adc2::clear_flags(AdcFlag::all);
        Adc1::start();
        spins = 0;
        while (!Adc1::ready() && spins < 100000u) {
            ++spins;
        }
        const uint16_t same_m = Adc1::result();
        const uint16_t same_s = Adc2::result();
        print(serial, "  ONE pad on both: ADC1 ", same_m, ", ADC2 ", same_s, ", difference ",
              abs_diff(same_m, same_s), " LSB (single-converter answer ", single4, ")", crlf);
        bench.verdict("the two converters sampling the SAME pad at the same time still agree "
                      "with each other and with the single-converter answer - the chapter's "
                      "caution costs nothing on a source this stiff",
                      abs_diff(same_m, same_s) < 60u && abs_diff(same_m, single4) < 80u);

        (void)AdcCommon::multi(AdcMulti::independent);
        bench.verdict("and coming back to independent mode is one write",
                      AdcCommon::multi() == AdcMulti::independent);
        analog_down();
    }
#endif
#endif
}

// =============================================================================
// k - the wave generators
// =============================================================================
void tk_waves() {
#if !defined(DAC_BASE)
    needs_dac("letter k");
#else
    {
        if (!adc_up(base_config())) {
            bench.verdict("the converter came up", false);
            return;
        }
        Dac::init();
        Dac::claim_pad<Pa4>();
        DacChannelConfig cfg{};
        cfg.triggered = true;
        cfg.trigger = DacTrigger::software;
        cfg.wave = DacWave::noise;
        cfg.amplitude = 11;   // the whole twelve bits unmasked
        bench.verdict("a noise channel configures", Dac::configure(dac_ch_pa4, cfg));
        (void)Dac::write(dac_ch_pa4, 0);
        (void)Dac::enable(dac_ch_pa4, true);
        (void)delay_us(clock, 20);

        // THE ONE DETERMINISTIC THING ABOUT AN LFSR: its preload. 14.3.8
        // gives 0xAAA, and figure 98 gives the value after one more step.
        (void)Dac::trigger(dac_ch_pa4);
        (void)delay_us(clock, 5);
        const uint16_t first = Dac::output(dac_ch_pa4);
        (void)Dac::trigger(dac_ch_pa4);
        (void)delay_us(clock, 5);
        const uint16_t second = Dac::output(dac_ch_pa4);
        print(serial, "  LFSR with DHR = 0: first trigger gives ", hex(first),
              ", second gives ", hex(second), " (14.3.8 preloads ", hex(dac_lfsr_preload),
              ", figure 98 steps to 0xD55)", crlf);
        bench.verdict("the LFSR's preload is on the output after ONE trigger",
                      first == dac_lfsr_preload);
        bench.verdict("and the second step is figure 98's own value", second == 0x0D55u);

        // Resetting WAVE reloads it (14.3.8's last sentence).
        (void)Dac::wave(dac_ch_pa4, DacWave::none);
        (void)Dac::wave(dac_ch_pa4, DacWave::noise);
        (void)Dac::trigger(dac_ch_pa4);
        (void)delay_us(clock, 5);
        bench.verdict("clearing WAVEx RESETS the generator - the next trigger gives the "
                      "preload again", Dac::output(dac_ch_pa4) == dac_lfsr_preload);

        // The noise as the ADC sees it on the pad.
        Adc1::select(In4{});
        uint16_t nmin = 0xFFFFu, nmax = 0;
        for (uint16_t k = 0; k < 400u; ++k) {
            (void)Dac::trigger(dac_ch_pa4);
            (void)delay_us(clock, 10);
            const uint16_t v = Adc1::read();
            if (v < nmin) nmin = v;
            if (v > nmax) nmax = v;
        }
        print(serial, "  400 noise steps read back through the pad: ", nmin, " .. ", nmax, crlf);
        bench.verdict("the noise reaches most of the range on the PAD, not just in DOR",
                      static_cast<uint16_t>(nmax - nmin) > 2000u);

        // The triangle, whose amplitude is the one thing MAMP promises.
        static const uint8_t mamps[2] = {7, 9};
        bool amplitudes_right = true;
        for (uint8_t i = 0; i < 2u; ++i) {
            DacChannelConfig t = cfg;
            t.wave = DacWave::triangle;
            t.amplitude = mamps[i];
            (void)Dac::enable(dac_ch_pa4, false);
            (void)Dac::configure(dac_ch_pa4, t);
            (void)Dac::write(dac_ch_pa4, 0);
            (void)Dac::enable(dac_ch_pa4, true);
            (void)delay_us(clock, 20);
            uint16_t lo = 0xFFFFu, hi = 0;
            const uint16_t steps = static_cast<uint16_t>(4u * (dac_wave_amplitude(mamps[i]) + 1u));
            for (uint16_t k = 0; k < steps; ++k) {
                (void)Dac::trigger(dac_ch_pa4);
                const uint16_t v = Dac::output(dac_ch_pa4);
                if (v < lo) lo = v;
                if (v > hi) hi = v;
            }
            const uint16_t expect = dac_wave_amplitude(mamps[i]);
            print(serial, "    MAMP ", mamps[i], ": DOR swept ", lo, " .. ", hi, ", amplitude ",
                  expect, " expected", crlf);
            if (lo != 0u || hi != expect) {
                amplitudes_right = false;
            }
        }
        bench.verdict("the triangle's peak is exactly 2^(MAMP+1) - 1 above the holding "
                      "register, and it comes back to it", amplitudes_right);
        analog_down();
    }
#endif
}

// =============================================================================
// l - overrun, and the two data-management modes
// =============================================================================
void tl_overrun() {
    AdcConfig c = base_config();
    c.continuous = true;
    c.eoc_per_conversion = true;   // 13.13.3: this is what enables detection
    if (!adc_up(c, AdcSampleTime::cycles3)) {
        bench.verdict("the converter came up", false);
        return;
    }
    AdcCommon::internal_sources(true);
    Adc1::select(AdcInput::vrefint);
    (void)delay_us(clock, 20);

    Adc1::clear_flags(AdcFlag::all);
    Adc1::start();
    (void)delay_us(clock, 200);   // many conversions, none of them read
    const bool over = Adc1::overrun();
    print(serial, "  EOCS = 1, continuous, nothing read for 200 us: OVR ", over ? "up" : "down",
          crlf);
    bench.verdict("with EOC at every conversion, an unread result raises OVR (13.8.2)", over);

    // The recovery the chapter gives: clear the flag and trigger again.
    Adc1::stop();
    Adc1::clear_flags(AdcFlag::all);
    uint16_t after = 0;
    const bool recovered = Adc1::read(after);
    print(serial, "  after clearing OVR and starting again: ", after, crlf);
    bench.verdict("clearing OVR and re-triggering is the whole recovery, and the flag stays "
                  "down", recovered && !Adc1::overrun());

