uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
    // And the mode where the chapter says there is no detection at all.
    c.eoc_per_conversion = false;
    c.dma = false;
    (void)Adc1::configure(c);
    Adc1::clear_flags(AdcFlag::all);
    Adc1::start();
    (void)delay_us(clock, 200);
    const bool quiet = !Adc1::overrun();
    Adc1::stop();
    print(serial, "  EOCS = 0 and no DMA, the same 200 us: OVR ", quiet ? "down" : "up", crlf);
    bench.verdict("13.8.3 MEASURED: with EOC at the end of the sequence and no DMA there is "
                  "no overrun detection at all - converting without reading is a CHOICE the "
                  "chapter offers", quiet);

    AdcCommon::internal_sources(false);
    analog_down();
}

// =============================================================================
// m - the sequencer-during-conversion erratum, and the refusal that answers it
// =============================================================================
void tm_erratum() {
    if (!adc_up(base_config())) {
        bench.verdict("the converter came up", false);
        return;
    }
    AdcCommon::internal_sources(true);
    Adc1::select(AdcInput::vrefint);
    (void)delay_us(clock, 20);
    const uint8_t other = adc_input_channel(AdcInput::vbat);

    // A 480-cycle sampling time makes one conversion about 22 us at
    // 22.5 MHz - long enough to rewrite the sequence inside it from a
    // 180 MHz core.
    Adc1::clear_flags(AdcFlag::all);
    Adc1::start();
    // STRT is what the driver's own "in flight" answer rests on.
    uint32_t spins = 0;
    while (!Adc1::started() && spins < 1000u) {
        ++spins;
    }
    const bool saw_started = Adc1::started();
    const bool refused = !Adc1::select_channel(other);

    // AND THE ERRATUM ITSELF, staged with the unchecked verb - INSIDE the
    // same conversion, which is why nothing is printed until it is over:
    // a console line at 115200 is longer than the 22 us this conversion
    // lasts.
    static uint8_t one[1] = {0};
    one[0] = other;
    (void)Adc1::regular_sequence_unchecked(one, 1);
    uint32_t waited = 0;
    while (!Adc1::ready() && waited < 200000u) {
        ++waited;
    }
    const bool never_came = !Adc1::ready();

    print(serial, "  STRT rose after ", spins, " polls; the driver ",
          refused ? "REFUSED" : "accepted", " a sequence write inside the conversion", crlf);
    bench.verdict("STRT rises as soon as a conversion starts, which is what makes the "
                  "in-flight answer possible at all", saw_started);
    bench.verdict("and the driver REFUSES a sequence write there - the structural answer to "
                  "the errata item", refused);
    print(serial, "  the sequence rewritten INSIDE a software-started conversion: EOC ",
          never_came ? "never arrived" : "arrived anyway", " after ", waited, " polls", crlf);
    bench.verdict("THE ERRATUM MEASURED: with a software start, a sequence written during a "
                  "conversion resets it and nothing restarts it", never_came);

    // The workaround: start again.
    Adc1::start();
    uint16_t v = 0;
    uint32_t again = 0;
    while (!Adc1::ready() && again < 200000u) {
        ++again;
    }
    if (Adc1::ready()) {
        v = Adc1::result();
    }
    print(serial, "  one more SWSTART and the new sequence converts: ", v, crlf);
    bench.verdict("and the errata's own workaround - trigger again - brings it back",
                  again < 200000u);

    // THE HARDWARE TRIGGER IS SPARED, which is the other half of the
    // item's own text - and the only way to say it on this board is a pad
    // driven onto its own EXTI line (letter o is where that technique is
    // established).
    if constexpr (have_trigger_pads) {
#if defined(STM32F446xx)
        AdcConfig c = base_config();
        c.trigger = AdcTrigger::exti11;
        c.trigger_edge = AdcEdge::rising;
        (void)Adc1::configure(c);
        (void)Adc1::select_channel(adc_input_channel(AdcInput::vrefint));
        arm_pad_line<TrigPad11>(adc_regular_exti_line);
        Adc1::clear_flags(AdcFlag::all);

        // One edge starts a conversion; the sequence is rewritten inside
        // it, so that conversion is lost - and the NEXT edge starts the
        // new sequence with no software help at all.
        pad_edge<TrigPad11>(adc_regular_exti_line);
        (void)Adc1::regular_sequence_unchecked(one, 1);
        uint32_t lost = 0;
        while (!Adc1::ready() && lost < 20000u) {
            ++lost;
        }
        const bool first_lost = !Adc1::ready();
        pad_edge<TrigPad11>(adc_regular_exti_line);
        uint32_t hw = 0;
        while (!Adc1::ready() && hw < 20000u) {
            ++hw;
        }
        const bool recovered = Adc1::ready();
        const uint16_t hw_value = Adc1::result();
        TrigPad11::release();
        (void)Exti::release(adc_regular_exti_line);
        print(serial, "  with a HARDWARE trigger: the conversion the rewrite landed in was ",
              first_lost ? "lost" : "delivered anyway", " and the NEXT edge converted ",
              recovered ? "" : "nothing, ", hw_value, crlf);
        bench.verdict("and the erratum SPARES the hardware trigger, as its own text says: no "
                      "software touched the converter between the rewrite and the result",
                      first_lost && recovered && hw_value > 100u);
#endif
    } else {
        print(serial, "  no pad on line 11 this suite knows to be free on this board: the "
                      "hardware trigger's half of the item is not staged here", crlf);
    }

    AdcCommon::internal_sources(false);
    analog_down();
}

// =============================================================================
// n - the flash accelerator against the converter's spread
// =============================================================================
void tn_noise() {
    if (!adc_up(base_config())) {
        bench.verdict("the converter came up", false);
        return;
    }
    AdcCommon::internal_sources(true);
    Adc1::select(AdcInput::vrefint);
    (void)delay_us(clock, 20);
    console_drain();

