uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
    uint16_t spread[2] = {0, 0};
    uint32_t mean[2] = {0, 0};
    for (uint8_t pass = 0; pass < 2u; ++pass) {
        FlashAccel::prefetch(pass == 0u);
        uint16_t lo = 0xFFFFu, hi = 0;
        uint32_t sum = 0;
        for (uint16_t k = 0; k < 256u; ++k) {
            const uint16_t v = Adc1::read();
            if (v < lo) lo = v;
            if (v > hi) hi = v;
            sum += v;
        }
        spread[pass] = static_cast<uint16_t>(hi - lo);
        mean[pass] = sum / 256u;
    }
    FlashAccel::prefetch(true);
    print(serial, "  256 conversions of VREFINT: prefetch ON spread ", spread[0], " LSB (mean ",
          mean[0], "), prefetch OFF spread ", spread[1], " LSB (mean ", mean[1], ")", crlf);
    bench.verdict("the converter is quiet either way at 12 bits - a handful of LSB, not a "
                  "handful of per cent", spread[0] < 40u && spread[1] < 40u);
    bench.verdict("and the two means agree, so the errata's workaround costs the ACCURACY "
                  "nothing and buys the NOISE what this letter reports",
                  abs_diff(static_cast<uint16_t>(mean[0]), static_cast<uint16_t>(mean[1])) < 20u);
    bench.verdict("the accelerator is back on where the clock task left it",
                  FlashAccel::prefetch() && FlashAccel::icache() && FlashAccel::dcache());
    AdcCommon::internal_sources(false);
    analog_down();
}

// =============================================================================
// o - the external trigger path, through the EXTI's software trigger
// =============================================================================

void to_trigger() {
    AdcConfig c = base_config();
    c.trigger = AdcTrigger::exti11;
    c.trigger_edge = AdcEdge::rising;
    c.injected_trigger = AdcInjectedTrigger::exti15;
    c.injected_trigger_edge = AdcEdge::rising;
    if (!adc_up(c)) {
        bench.verdict("the converter came up", false);
        return;
    }
    AdcCommon::internal_sources(true);
    Adc1::select(AdcInput::vrefint);
    static uint8_t one[1] = {0};
    one[0] = adc_input_channel(AdcInput::vrefint);
    (void)Adc1::injected_sequence(one, 1);
    (void)delay_us(clock, 20);

    // The lines are armed with a rising sense and as EVENTS first:
    // nothing is bound to a vector here and the NVIC lines stay disabled
    // throughout, so a pending bit is a witness and never a handler.
    (void)Exti::sense(adc_regular_exti_line, ExtiSense::rising);
    (void)Exti::event(adc_regular_exti_line, true);
    (void)Exti::sense(adc_injected_exti_line, ExtiSense::rising);
    (void)Exti::event(adc_injected_exti_line, true);

    Adc1::clear_flags(AdcFlag::all);
    (void)delay_us(clock, 200);
    const bool quiet = !Adc1::ready() && !Adc1::injected_ready();
    bench.verdict("with a hardware trigger selected and no edge, nothing converts", quiet);

    // WHICH MASK THE SOFTWARE TRIGGER OBEYS is the question this letter
    // answers, and the two chapters between them do not: 12.3.6 gives
    // SWIER's own condition in terms of the INTERRUPT mask alone, and the
    // ADC's table 87 says only "EXTI line 11".
    const bool with_event = trigger_converts(adc_regular_exti_line, false);
    (void)Exti::interrupt(adc_regular_exti_line, true);
    const bool with_interrupt = trigger_converts(adc_regular_exti_line, false);
    const bool line_fired = Exti::pending(adc_regular_exti_line);
    print(serial, "  line ", adc_regular_exti_line, " raised by SWIER: the line ",
          line_fired ? "FIRED" : "did not fire", ", the converter answered with EMR alone ",
          with_event ? "yes" : "no", " and with IMR open too ", with_interrupt ? "yes" : "no",
          crlf);
    bench.verdict("THE SOFTWARE TRIGGER DOES NOT REACH THE CONVERTER: SWIER raises the line's "
                  "own pending bit and no conversion follows it, under either mask - so the "
                  "ADC's trigger takes the EDGE DETECTOR's output and not the register's",
                  line_fired && !with_event && !with_interrupt);
    (void)Exti::clear(adc_regular_exti_line);
    (void)Exti::interrupt(adc_regular_exti_line, false);

    // SWSTART is not EXTEN's business. 13.13.3 gives the two bits
    // separately and this is what that means: a converter armed for a
    // hardware trigger still converts when the software asks.
    Adc1::clear_flags(AdcFlag::all);
    Adc1::start();
    uint32_t spins = 0;
    while (!Adc1::ready() && spins < 20000u) {
        ++spins;
    }
    const uint16_t by_software = Adc1::result();
    bench.verdict("and SWSTART is INDEPENDENT of it: a converter armed for a hardware trigger "
                  "still converts on the software one", spins < 20000u && by_software > 100u);

    if constexpr (have_trigger_pads) {
#if defined(STM32F446xx)
        // A REAL EDGE now, from a pad this program drives itself - once
        // with the event mask alone and once with the interrupt mask too.
        const bool pad_unmasked =
            pad_edge_converts<TrigPad11>(adc_regular_exti_line, false, false, false);
        const bool pad_event_only =
            pad_edge_converts<TrigPad11>(adc_regular_exti_line, false, true, false);
        const bool pad_irq_only =
            pad_edge_converts<TrigPad11>(adc_regular_exti_line, false, false, true);
        const uint16_t pad_value = Adc1::result();
        print(serial, "  a rising edge driven onto the line's own pad converts: with NEITHER "
              "mask ", pad_unmasked ? "yes" : "no", ", with EMR alone ",
              pad_event_only ? "yes" : "no", ", with IMR alone ", pad_irq_only ? "yes" : "no",
              "; DR ", pad_value, crlf);
        bench.verdict("THE REGULAR TRIGGER PATH, MEASURED WITH NO WIRE: a pad driven high feeds "
                      "its own EXTI line, and line 11 starts a regular conversion",
                      pad_event_only && pad_value > 100u);
        bench.verdict("and NEITHER MASK GATES IT: the converter takes the EDGE DETECTOR's "
                      "output, which is why an unmasked line still triggers and why the "
                      "software trigger - injected past that detector - never does",
                      pad_unmasked && pad_irq_only);
        const bool inj_by_pad =
            pad_edge_converts<TrigPad15>(adc_injected_exti_line, true, true, false);
        print(serial, "  and on line 15: JEOC ", inj_by_pad ? "yes" : "no", ", JDR1 ",
              Adc1::injected_result(1), crlf);
        bench.verdict("and the injected group has a line of its own, line 15",
                      inj_by_pad && Adc1::injected_result(1) > 100);
#endif
    } else {
        print(serial, "  no pad on lines 11 and 15 this suite knows to be free on this board: "
                      "the edge that would start a conversion is not staged here", crlf);
    }

    (void)Exti::clear(adc_regular_exti_line);
    (void)Exti::clear(adc_injected_exti_line);
    (void)Exti::release(adc_regular_exti_line);
    (void)Exti::release(adc_injected_exti_line);
    bench.verdict("and both lines clear and release on demand",
                  !Exti::pending(adc_regular_exti_line) &&
                      !Exti::pending(adc_injected_exti_line));
    AdcCommon::internal_sources(false);
    analog_down();
}

