uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
// =============================================================================
// p - AnalogSampler inside a real kernel, walking three inputs
// =============================================================================

struct Collector;
using Subs = Subscribers<Collector>;

// THE LIST IS THE SAME ON EVERY PART, and the third input is a PAD -
// values of two different types in one pack, an AdcInput enumerator and
// an AnalogIn. The divided battery would have been the obvious stand-in
// where no DAC can drive that pad, and it CANNOT BE ONE: on every class
// but the F405's the sensor and the battery share a channel, so a list
// naming both would be two inputs with one code and the sampler's own
// static_assert says so. A pad with nothing on it is still a distinct
// input, and this letter judges what it does with the LABEL, not with
// the value.
using Sampler = AnalogSampler<Adc1, P, Subs, AdcInput::vrefint, AdcInput::temperature, In4{}>;
constexpr const char* third_input_name = have_dac ? "the DAC's pad" : "an undriven pad";

struct Collector {
    using Event = std::variant<AnalogSample>;
    static inline EventQueue<Event, 8, P> queue;

    static inline uint16_t samples = 0;
    static inline uint16_t per_index[3] = {0, 0, 0};
    static inline uint16_t last[3] = {0, 0, 0};

    static void init() {
        samples = 0;
        for (uint8_t i = 0; i < 3u; ++i) {
            per_index[i] = 0;
            last[i] = 0;
        }
    }

    static void dispatch(const Event& e) {
        match(e, [](const AnalogSample& s) {
            if (s.index < 3u) {
                ++per_index[s.index];
                last[s.index] = s.value;
            }
            ++samples;
        });
    }
};

using AnalogKernel = Tenuto<P, Collector, Sampler>;

bool kernel_mode = false;

void tp_sampler() {
    if (!adc_up(base_config())) {
        bench.verdict("the converter came up", false);
        return;
    }
    AdcCommon::internal_sources(true);
#if defined(DAC_BASE)
    (void)dac_up(dac_ch_pa4, 3000);
#endif
    (void)delay_us(clock, 20);
    console_drain();

    Adc1::interrupts(AdcFlag::converted, true);
    Nvic::clear_pending(Adc1::irq());
    Nvic::enable(Adc1::irq());
    AnalogKernel::init_all();
    kernel_mode = true;
    Sampler::start_every(2);   // one conversion every 2 ms

    // Tenuto::step() serves ONE queued event and nothing else - only
    // Tenuto::run() matures time events, and this loop is not run(). The
    // sampler's software pace IS a time event, so the pump does both
    // halves by hand.
    const uint32_t deadline = Ticker::ticks() + 400u;
    while (Collector::samples < 60u && Ticker::ticks() < deadline) {
        TimeEvents<P>::process();
        while (AnalogKernel::step()) {
        }
    }
    Sampler::stop();
    for (uint8_t i = 0; i < 8u; ++i) {
        (void)AnalogKernel::step();
    }
    kernel_mode = false;
    Nvic::disable(Adc1::irq());
    Adc1::interrupts(AdcFlag::converted, false);

    const uint16_t vdda = Adc1::vdda_mv(Collector::last[0]);
    print(serial, "  ", Collector::samples, " samples: VREFINT ", Collector::per_index[0],
          " (last ", Collector::last[0], " = VDDA ", vdda, " mV), sensor ",
          Collector::per_index[1], " (last ", Collector::last[1], "), ", third_input_name, " ",
          Collector::per_index[2], " (last ", Collector::last[2], "); unknown inputs ",
          Sampler::unknown_inputs(), ", queue overflows ", Collector::queue.overflows(), crlf);

    bench.verdict("AnalogSampler RUNS UNCHANGED ON THIS ARCHITECTURE: an active object "
                  "walking three inputs of a converter whose sequencer and DMA it does not use",
                  Collector::samples >= 60u);
    bench.verdict("the walk is EVEN - three inputs, three roughly equal counts, because the "
                  "sampler selects the next one on every result",
                  Collector::per_index[0] >= 18u && Collector::per_index[1] >= 18u &&
                      Collector::per_index[2] >= 18u);
    bench.verdict("and NOT ONE sample was mislabelled: every result carried a code the list "
                  "knows", Sampler::unknown_inputs() == 0u);
    bench.verdict("the values are the right ones for their labels", vdda >= 2700u && vdda <= 3600u);
#if defined(DAC_BASE)
    bench.verdict("and the DAC's pad reads near the code this letter set it to",
                  abs_diff(Collector::last[2], 3000u) < 200u);
#endif
    AdcCommon::vbat(false);
    AdcCommon::internal_sources(false);
    analog_down();
}

// =============================================================================
// q - the ADC's DMA: a scan of four channels into memory
// =============================================================================

/// ADC1's request is DMA2's stream 0 on channel 0 (or stream 4 on the
/// same channel) - the reserve's own table, and the driver checks the
/// cell rather than trusting this line.
using AdcStream = DmaRxEngine<2, 0, 0, uint16_t>;
static_assert(Adc1::engine_placed<AdcStream>(),
              "the stream this suite uses must be one of ADC1's own cells");

volatile bool adc_dma_complete = false;
volatile uint8_t adc_dma_errors = 0;

void tq_adc_dma() {
    AdcConfig c = base_config();
    c.scan = true;                   // walk the sequence, one conversion each
    c.eoc_per_conversion = false;    // EOC at the END of the sequence
    c.dma = true;
    if (!adc_up(c)) {
        bench.verdict("the converter came up", false);
        return;
    }
    AdcCommon::internal_sources(true);
#if defined(DAC_BASE)
    Dac::init();
    (void)dac_channel_up(dac_ch_pa4, 1000);
    (void)dac_channel_up(dac_ch_pa5, 3000);
#endif
    (void)delay_us(clock, 30);

    static const uint8_t seq[4] = {In4::channel, In5::channel,
                                   adc_input_channel(AdcInput::vrefint),
                                   adc_input_channel(AdcInput::temperature)};
    bench.verdict("a four-rank regular sequence writes",
                  Adc1::regular_sequence(seq, 4) && Adc1::sequence_length() == 4u);

