uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
    static uint16_t block[4] = {0, 0, 0, 0};
    Dma<2>::init();
    adc_dma_complete = false;
    adc_dma_errors = 0;
    AdcStream::arm(Adc1::data_address());
    bench.verdict("the stream takes a run of four halfwords",
                  AdcStream::start(block, 4));

    Adc1::clear_flags(AdcFlag::all);
    Adc1::start();
    uint32_t spins = 0;
    while (!adc_dma_complete && spins < 200000u) {
        ++spins;
    }
    const bool moved = adc_dma_complete;
    const bool overran = Adc1::overrun();
    print(serial, "  four ranks into memory after ", spins, " polls: ", block[0], " ", block[1],
          " ", block[2], " ", block[3], " (errors ", adc_dma_errors, ", OVR ",
          overran ? "up" : "down", ")", crlf);
    bench.verdict("ONE trigger, FOUR conversions, four halfwords in memory - the stream's own "
                  "completion says when", moved && adc_dma_errors == 0u);
    bench.verdict("and they are in the SEQUENCE's order, each rank on its own channel",
                  block[2] > 1200u && block[2] < 1800u && block[3] > 700u && block[3] < 1200u);
#if defined(DAC_BASE)
    bench.verdict("the first two ranks are the two DAC pads, two thousand codes apart",
                  abs_diff(block[0], 1000u) < 200u && abs_diff(block[1], 3000u) < 200u &&
                      block[1] > block[0]);
#endif
    bench.verdict("nothing overran: the stream took every result before the next arrived",
                  !overran);

    // DDS = 0 MEANS THE CONVERTER STOPS ASKING, and 13.8.1 says what it
    // takes to make it ask again: "the DMA bit is not cleared by hardware.
    // It must be written to 0, then to 1 to start a new transfer." So a
    // fresh stream over an untouched CR2 gets nothing at all.
    for (uint8_t i = 0; i < 4u; ++i) {
        block[i] = 0;
    }
    adc_dma_complete = false;
    (void)AdcStream::start(block, 4);
    Adc1::clear_flags(AdcFlag::all);
    Adc1::start();
    (void)delay_us(clock, 400);
    const uint16_t stale_taken = AdcStream::take();
    const uint32_t stale_sr = Adc1::flags();
    print(serial, "  a second run over an untouched CR2 moved ", stale_taken,
          " halfwords and left SR ", hex(stale_sr), crlf);
    bench.verdict("13.8.1 MEASURED: with DDS clear the converter stops asking after the last "
                  "transfer, and a fresh stream over an untouched converter gets NOTHING - the "
                  "conversions run, the results pile in one register and no request is made",
                  stale_taken == 0u && (stale_sr & AdcFlag::converted) != 0u);

    // WHAT MAKES IT ASK AGAIN is not this letter's answer to give: neither
    // a cycled DMA bit nor a full re-initialization of both ends brought a
    // second block back here, and the arrangement the chapter really
    // points at for a stream that keeps running is DDS with a CIRCULAR
    // one, which these engines do not offer. It is in the gap list with
    // that reason.

    // AND THE SAME SEQUENCE WITH NO STREAM AT ALL. The counter-experiment
    // is the whole reason this register needs a DMA: four conversions into
    // one data register, three of them lost, and the flag that says so
    // (13.8.2's own arrangement - EOC at every conversion, no DMA).
    AdcStream::stop();
    AdcConfig polled = c;
    polled.dma = false;
    polled.eoc_per_conversion = true;
    (void)Adc1::configure(polled);
    Adc1::clear_flags(AdcFlag::all);
    Adc1::start();
    (void)delay_us(clock, 400);
    const bool lost = Adc1::overrun();
    const uint16_t only = Adc1::result();
    print(serial, "  the same four ranks with no stream and EOC at every conversion: OVR ",
          lost ? "up" : "down", ", one datum left in DR (", only, ")", crlf);
    bench.verdict("WITHOUT the stream the same sequence overruns - four conversions into one "
                  "register is what the DMA is for", lost);

    AdcStream::stop();
    Nvic::disable(Dma<2>::irq(0));
    AdcCommon::internal_sources(false);
    analog_down();
}

// =============================================================================
// r - the DAC's DMA: a table played by a hardware trigger, and the underrun
// =============================================================================
#if defined(DAC_BASE)
/// DAC channel 1's request is DMA1's stream 5 on channel 7, and its only
/// cell. THE ELEMENT IS A WORD: 14.5 says the DAC's registers "have to be
/// accessed by words (32 bits)", so the beat is 32 bits wide even though
/// the datum is twelve.
using DacStream = DmaTxEngine<1, 5, 7, uint32_t>;
static_assert(Dac::engine_placed<DacStream>(dac_ch_pa4),
              "the stream this suite uses must be DAC channel 1's own cell");

volatile bool dac_dma_complete = false;
volatile uint8_t dac_dma_errors = 0;
#endif

void tr_dac_dma() {
#if !defined(DAC_BASE)
    needs_dac("letter r");
#elif !defined(STM32F446xx)
    print(serial, "  no pad on EXTI line 9 this suite knows to be free on this board: the "
                  "DAC's DMA request comes from a HARDWARE trigger only (14.3.7) and there "
                  "is none to give it here", crlf);
#else
    {
        // The trigger is EXTI line 9 - the DAC's own table 94 row - driven
        // from a pad this program owns, because 14.3.7 raises no request
        // at all on the software trigger.
        using TrigPad9 = Pin<'C', 9>;   // free on the Nucleo's Morpho header
        constexpr uint8_t dac_line = dac_exti_line;

        if (!adc_up(base_config())) {
            bench.verdict("the converter came up", false);
            return;
        }
        Adc1::select(In4{});

        static const uint32_t table[8] = {200, 700, 1200, 1700, 2200, 2700, 3200, 3700};
        Dac::init();
        Dac::claim_pad<Pa4>();
        DacChannelConfig cfg{};
        cfg.triggered = true;
        cfg.trigger = DacTrigger::exti9;
        cfg.dma = true;
        bench.verdict("a DMA-fed, hardware-triggered channel configures",
                      Dac::configure(dac_ch_pa4, cfg));
        // 14.3.7: the FIRST datum is the holding register's, and the DMA
        // refills it behind each trigger - so the run starts at the
        // table's second entry.
        (void)Dac::write(dac_ch_pa4, table[0]);

        Dma<1>::init();
        dac_dma_complete = false;
        dac_dma_errors = 0;
        DacStream::arm(Dac::data_address_12r(dac_ch_pa4));
        bench.verdict("the stream takes the table's tail", DacStream::start(&table[1], 7));

        (void)Dac::enable(dac_ch_pa4, true);
        (void)delay_us(clock, 20);
        Dac::clear_flags(0xFFFFFFFFu);

