uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
        // ES0206 2.6.1 / ES0298 2.7.1 IS WHY THIS COUNT EXISTS. A request
        // left pending when a DMA-to-DAC round is stopped survives both
        // the DMAEN clear and the clock being closed, and is served the
        // moment the converter comes back - so the stream can have taken
        // a beat before any edge. It was seen once, after this letter
        // followed the ADC's DMA letter, and it does not reproduce on
        // demand; so the offset is COUNTED and the table compared from
        // where the stream really is, rather than assumed to be zero.
        (void)delay_us(clock, 10);
        const uint16_t spurious = DacStream::progress().done;

        TrigPad9::output(false);
        (void)Exti::steal(dac_line, 'C');
        (void)Exti::sense(dac_line, ExtiSense::rising);
        (void)Exti::event(dac_line, true);
        (void)Exti::clear(dac_line);

        const uint8_t edges = static_cast<uint8_t>(8u - spurious);
        uint16_t played[8] = {0, 0, 0, 0, 0, 0, 0, 0};
        bool followed = true;
        for (uint8_t i = 0; i < edges; ++i) {
            (void)Exti::clear(dac_line);
            TrigPad9::set();
            (void)delay_us(clock, 2);
            TrigPad9::clear();
            (void)delay_us(clock, 40);   // the DAC's settling, then a conversion
            played[i] = Adc1::read();
            if (abs_diff(played[i], static_cast<uint16_t>(table[i + spurious])) > 120u) {
                followed = false;
            }
        }
        print(serial, "  ", edges, " edges played");
        for (uint8_t i = 0; i < edges; ++i) {
            print(serial, " ", played[i]);
        }
        print(serial, " for a table of 200..3700 by 500 from entry ", spurious, crlf);
        bench.verdict("A TABLE PLAYED BY HARDWARE: one pad edge, one trigger, one DMA beat "
                      "into the holding register, and the pad follows the table",
                      followed && edges >= 7u);
        bench.verdict("and the stream reported its own completion after the last beat",
                      dac_dma_complete && dac_dma_errors == 0u);
        print(serial, "  beats taken before the first edge: ", spurious, crlf);
        bench.verdict("and AT MOST ONE beat was taken before the first trigger - the count is "
                      "the SPURIOUS REQUEST of ES0206 2.6.1 / ES0298 2.7.1, which this letter "
                      "measures instead of assuming away because a request left pending by an "
                      "earlier round survives the DMAEN clear and the clock being closed",
                      spurious <= 1u);
        bench.verdict("no underrun while the stream was serving - and none on the ONE trigger "
                      "past its last beat either, because 14.3.7 wants a SECOND unserved one",
                      !Dac::underrun(dac_ch_pa4));

        // THE UNDERRUN. The stream is spent, so the next triggers raise
        // requests nobody acknowledges - 14.3.7's own condition - and the
        // channel keeps converting the old datum.
        for (uint8_t i = 0; i < 3u; ++i) {
            (void)Exti::clear(dac_line);
            TrigPad9::set();
            (void)delay_us(clock, 2);
            TrigPad9::clear();
            (void)delay_us(clock, 20);
        }
        const bool under = Dac::underrun(dac_ch_pa4);
        const uint16_t held = Adc1::read();
        print(serial, "  three more edges with the stream spent: DMAUDR ", under ? "up" : "down",
              ", the pad still at ", held, crlf);
        bench.verdict("A SPENT STREAM IS AN UNDERRUN: the trigger keeps arriving, nobody "
                      "acknowledges the request, and DMAUDRx says so", under);
        bench.verdict("and the channel keeps converting the OLD datum rather than going quiet",
                      abs_diff(held, static_cast<uint16_t>(table[7])) < 150u);

        // The errata's stop sequence, as far as this driver reaches.
        bench.verdict("stop_dma() clears the flag and drops both DMAEN and the enable",
                      Dac::stop_dma(dac_ch_pa4) && !Dac::underrun(dac_ch_pa4) &&
                          !Dac::enabled(dac_ch_pa4));
        DacStream::stop();
        Nvic::disable(Dma<1>::irq(5));
        TrigPad9::release();
        (void)Exti::release(dac_line);
        analog_down();
    }
#endif
}

void banner() {
    print(serial, crlf, "test_stm32f4_analog - the ADC and the DAC, measured through the pad "
          "they share", crlf);
    bench.menu();
}

} // namespace

// ---- target glue --------------------------------------------------------------
#if defined(STM32F446xx)
extern "C" void USART2_IRQHandler() { (void)Serial::isr(); }
#elif defined(STM32F469xx)
extern "C" void USART3_IRQHandler() { (void)Serial::isr(); }
#else
extern "C" void USART1_IRQHandler() { (void)Serial::isr(); }
#endif
extern "C" void SysTick_Handler() { brio::Ticker::tick(); }

/// The ADC's one vector, shared by every converter. Letter p is the only
/// user; every other letter polls.
/// ONE VECTOR PER STREAM on this family, so each of these answers for
/// itself alone. The engines' `service()` reads and clears; what a
/// completion MEANS is the owner's, which here is a flag a letter waits
/// on.
extern "C" void DMA2_Stream0_IRQHandler() {
    const uint8_t hit = AdcStream::service();
    if ((hit & AdcStream::flag_complete) != 0u) {
        adc_dma_complete = true;
    }
    if ((hit & (AdcStream::flag_error | AdcStream::flag_fifo_error)) != 0u) {
        adc_dma_errors = static_cast<uint8_t>(adc_dma_errors + 1u);
    }
}

#if defined(DAC_BASE)
extern "C" void DMA1_Stream5_IRQHandler() {
    const uint8_t hit = DacStream::service();
    if ((hit & DacStream::flag_complete) != 0u) {
        (void)DacStream::complete();
        dac_dma_complete = true;
    }
    if ((hit & (DacStream::flag_error | DacStream::flag_fifo_error)) != 0u) {
        dac_dma_errors = static_cast<uint8_t>(dac_dma_errors + 1u);
    }
}
#endif

extern "C" void ADC_IRQHandler() {
    const uint32_t hit = Adc1::isr();
    if (kernel_mode && (hit & brio::AdcFlag::converted) != 0u) {
        brio::post<Sampler>(brio::Sampled{Adc1::result(), Adc1::selected()});
    }
}

