uliano/brio/stm32f4/src/apps/test_stm32f4_analog.cpp
int main() {
    const bool clock_ok = SysClock::init();
    const bool serial_ok = Serial::init(clock, 115200);
    const bool tick_ok = brio::Ticker::init(clock);
    Led::output(false);
    brio::enable_interrupts();

    bench.letter('a', "the block, the prescaler and every refusal", ta_block);
    bench.letter('b', "the DAC as an actuator: holding, output, formats, triggers", tb_dac);
    bench.letter('c', "the zero-length wire: the transfer curve", tc_transfer);
    bench.letter('d', "buffered against unbuffered, free pad and loaded pad", td_buffer);
    bench.letter('e', "the settling time after a step", te_settling);
    bench.letter('f', "the conversion time in ADCCLK cycles", tf_timing);
    bench.letter('g', "the scale: VDDA, the junction temperature, the battery", tg_scale);
    bench.letter('h', "the analog watchdog on a DAC step", th_watchdog);
    bench.letter('i', "the injected group and its preemption", ti_injected);
    bench.letter('j', "dual regular simultaneous mode", tj_dual);
    bench.letter('k', "the wave generators", tk_waves);
    bench.letter('l', "overrun and the two data-management modes", tl_overrun);
    bench.letter('m', "the sequencer-during-conversion erratum", tm_erratum);
    bench.letter('n', "the flash accelerator against the converter's spread", tn_noise);
    bench.letter('o', "the external trigger path through the EXTI", to_trigger);
    bench.letter('p', "AnalogSampler inside a real kernel", tp_sampler);
    bench.letter('q', "the ADC's DMA: a scan of four channels into memory", tq_adc_dma);
    bench.letter('r', "the DAC's DMA: a table played by a hardware trigger", tr_dac_dma);

    if (serial_ok) {
        brio::print(serial, brio::crlf, "boot: clk=", clock_ok ? "PLL" : "FAILED", " tick=",
                    tick_ok ? "SysTick" : "FAILED", " ADCs=", brio::adc_instances(),
                    " DAC=", have_dac ? "yes" : "no", brio::crlf);
        banner();
        bench.prompt();
    }

    for (;;) {
        uint8_t ch = 0;
        if (!Serial::read_byte(ch)) {
            continue;
        }
        if (ch == '\r' || ch == '\n') {
            continue;
        }
        brio::print(serial, static_cast<char>(ch), brio::crlf);
        if (ch == '?') {
            banner();
        } else if (!bench.handle(static_cast<char>(ch))) {
            brio::print(serial, "unknown letter (? for the menu)", brio::crlf);
        }
        bench.prompt();
    }
}
